In [95]:
# This is Option 1: Heroes of Pymoli 
#analyzing the data for their most recent fantasy game Heroes of Pymoli.

In [96]:
# Import the Pandas library
import pandas as pd
import os
import numpy as np
import json

In [97]:
#======================================================================================================

In [98]:
##################### This is the Starting section for "PLAYER COUNT" ##################################

In [99]:
#======================================================================================================

In [100]:
# Reading my 2 input files from json format
my_data1_df = pd.read_json('purchase_data.json')
my_data2_df = pd.read_json('purchase_data2.json')

#Took screenshots from "my_data1_df" and uploaded to the HW github.
#Working Input file 
my_data_df = my_data2_df

In [101]:
 
print(len(my_data_df))
my_data_df.head()

78

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

In [102]:
# Note that .describe() will only return summary statistics for your numeric columns(Age, Item ID, Price)
my_data_df.describe()

             Age     Item ID      Price
count  78.000000   78.000000  78.000000
mean   22.551282   93.935897   2.924359
std     7.339003   56.352633   1.134913
min     7.000000    0.000000   1.020000
25%    20.000000   48.000000   1.925000
50%    22.500000   97.500000   2.770000
75%    25.000000  137.000000   4.092500
max    40.000000  181.000000   4.810000

In [103]:
# Remove the rows with missing data
clean_df = my_data_df.dropna(how="any")
clean_df.count() #just to make sure I ran this dropping the rows with missing data - still same number which is consistent

Age          78
Gender       78
Item ID      78
Item Name    78
Price        78
SN           78
dtype: int64

In [104]:
# How many times each unique Players participated with the value counts.
Player_count = clean_df["SN"].value_counts()
Player_count.head()

Sundaky74       2
Aidaira26       2
Chaniman66      2
Hairith93       2
Undirrasta74    1
Name: SN, dtype: int64

In [105]:
# Get the unique Player_count with length fucntion
total_columns = len(Player_count.axes[0]) # Total number of Players with axes[0] <- Rows , axes[1] <- Column
print(total_columns)

74

In [106]:
#Creating a new dataframe for results of "Total Players"
 
my_list = [{"Total Players": total_columns }] 
total_players_df = pd.DataFrame(my_list)
total_players_df

   Total Players
0             74

In [107]:
#==================================================================================================================

In [108]:
##################### This is the Starting section for " PURCHASING ANALYSIS (Total)" ##############################

In [109]:
#==================================================================================================================

In [110]:
# List of unique item names from column
unique_item_names =  clean_df["Item Name"].unique()
#print(unique_item_names )

In [111]:
#Total unique item names, using len function to get the list/array length.
Total_unique_item_names = len(unique_item_names)
#Total_unique_item_names

In [112]:
# Average Purchase Price - in other words basically it is the mean value of the column "Price"
average_purchase_price =  clean_df["Price"].mean()
#print(average_purchase_price )

In [113]:
# Total Number of Purchases
Total_number_of_purchases = clean_df["Item ID"].count()
#Total_number_of_purchases

In [114]:
# Total Revenue
Total_revenue = clean_df["Price"].sum()
Total_revenue

228.0999999999999

In [115]:
# Gender Demographics

# Count of Male, Female, Non-Disclosed Players
Gender_count = clean_df["Gender"].value_counts() 

Gender_count.head()

Male                     64
Female                   13
Other / Non-Disclosed     1
Name: Gender, dtype: int64

In [116]:
# Total Count of the Column "Gender"
total_count_gender = clean_df["Gender"].count()
#total_count_gender

In [367]:
#Creating a new dataframe for results of "Purchasing Analysis (Total)" with adding dollar sign to it. formating

def dollarsign(x):
    return '${:,.2f}'.format(x) 
 
    
my_dict = {"Number of unique Items": [Total_unique_item_names],
           "Average Price": [average_purchase_price],
           "Number of Purchases": [Total_number_of_purchases],
           "Total Revenue":  [Total_revenue]}  

my_df_2 = pd.DataFrame(my_dict)
my_df_2['Total Revenue'] =  my_df_2['Total Revenue'].apply(dollarsign)
my_df_2['Average Price'] =  my_df_2['Average Price'].apply(dollarsign)



my_df_2

  Average Price  Number of Purchases  Number of unique Items Total Revenue
0         $2.92                   78                      63       $228.10

In [118]:
#==================================================================================================================

In [119]:
##################### This is the Starting section for " GENDER DEMOGRAPHICS " ##############################

In [120]:
#==================================================================================================================

In [121]:
Percentage_Male = (((Gender_count.loc["Male"])/total_count_gender)*100)
#print(Percentage_Male)

In [122]:
Percentage_Female = (((Gender_count.loc["Female"])/total_count_gender)*100)
#print(Percentage_Female)

In [123]:

Percentage_Other_Nondisclosed = (((Gender_count.loc["Other / Non-Disclosed"])/total_count_gender)*100)
#print(Percentage_Other_Nondisclosed)

In [370]:
# Creating a new dataframe for Gender Demographies
gender_dic = {"Gender": ["Male", "Female", "Other/Non-Disclosed"],
              "Percentage of Players": [Percentage_Male, Percentage_Female, Percentage_Other_Nondisclosed],
              "Total Count": [Gender_count.loc["Male"], Gender_count.loc["Female"], Gender_count.loc["Other / Non-Disclosed"]]}

gender_demography_df = pd.DataFrame(gender_dic) # set the row index to be "Gender"

#gender_demography_df

In [371]:
def percentsign(x):
    return '{:.2f}%'.format(x) 

gender_demography_df['Percentage of Players'] = gender_demography_df['Percentage of Players'].apply(percentsign)
#gender_demography_df

In [372]:
gender_demography_df = gender_demography_df.set_index("Gender")

gender_demography_df

                    Percentage of Players  Total Count
Gender
Male                               82.05%           64
Female                             16.67%           13
Other/Non-Disclosed                 1.28%            1

In [128]:
#==================================================================================================================

In [129]:
##################### This is the Starting section for " PURCHASING ANALYSIS (Gender) " ##############################

In [130]:
#==================================================================================================================

In [131]:
# Group my_data by the "Gender" column
grouped_Gender_df = my_data_df.groupby("Gender")

# Note that the "GroupBy" object by itself is not particularly useful
print(grouped_Gender_df)

<pandas.core.groupby.DataFrameGroupBy object at 0x106618320>

In [132]:
# Now the groupy object will be useful with the count/values
#grouped_Gender_df.count()

In [133]:
# This is the data type float with series
Gender_purchase_count = grouped_Gender_df["Price"].sum()
#Gender_purchase_count

In [134]:
type(grouped_Gender_df["Price"].sum())

pandas.core.series.Series

In [135]:
Gender_purchase_count.loc["Male"]
Gender_purchase_count.loc["Female"]
Gender_purchase_count.loc["Other / Non-Disclosed"]

2.1200000000000001

In [136]:
# This is the dataframe object which has all the sum of "Price" column grouped with the "Gender"
sum_Gender_df = grouped_Gender_df[["Price"]].sum()
#sum_Gender_df

In [137]:
type(sum_Gender_df) # Now that we have converted the sum_Gender_df to a DataFrame we can access the locations

pandas.core.frame.DataFrame

In [138]:
# Values are accessed with the .loc() for individual "Gender" column

sum_Gender_df.loc["Male"]
#sum_Gender_df.loc["Female"]
#sum_Gender_df.loc["Other / Non-Disclosed"]

Price    184.6
Name: Male, dtype: float64

In [139]:
# This is the data type float with series for Average/Mean purchase price
Gender_average_price = grouped_Gender_df["Price"].mean()
Gender_average_price

Gender
Female                   3.183077
Male                     2.884375
Other / Non-Disclosed    2.120000
Name: Price, dtype: float64

In [140]:
Gender_average_price.loc["Male"]
Gender_average_price.loc["Female"]
Gender_average_price.loc["Other / Non-Disclosed"]

2.1200000000000001

In [141]:
#grouped_players_df = clean_df.groupby(["SN", "Gender"])
#print(grouped_players_df) 


 
#create a new FILTERABLE object that has the count of each group (Male, Female, Other count) 
df = clean_df[['SN','Gender']].groupby(['SN','Gender']).size().reset_index(name='count')


Male_count_df = df[df.Gender == 'Male']
len(Male_count_df)
#Male_count_df

Female_count_df = df[df.Gender == 'Female']
#len(Female_count_df)
#Female_count_df
 
Other_count_df = df[df.Gender == 'Other / Non-Disclosed']
#len(Other_count_df)
#Other_count_df

In [142]:
# Normalization Totals in mathematical world
#Standardize = (X, mean, STDEV)
#mean = average
#X = starting number (move to each number at a time)
#STDEV = range (A1:A7) # column

In [143]:
# Normalized Totals for Male 
# Total Purchase Value/Number of players(each group)
male_normalized_total = (Gender_purchase_count.loc["Male"])/(len(Male_count_df) )

male_normalized_total
Gender_purchase_count.loc["Male"]

184.59999999999999

In [144]:
# Normalized Totals for Female 
# Total Purchase Value/Number of players(each group)
female_normalized_total = (Gender_purchase_count.loc["Female"])/(len(Female_count_df))
female_normalized_total

3.1830769230769231

In [145]:
# Normalized Totals for Other/Non-Disclosed
# Total Purchase Value/Number of players(each group)
other_normalized_total = (Gender_purchase_count.loc["Other / Non-Disclosed"])/(len(Other_count_df))
other_normalized_total

2.1200000000000001

In [146]:
 # Creating a new dataframe for Purchasing Analysis (Gender)
purchasing_analysis_gender_dic = {"Gender": ["Male", "Female", "Other/Non-Disclosed"],
                                  "Purchase Count": [Gender_count.loc["Male"], Gender_count.loc["Female"], Gender_count.loc["Other / Non-Disclosed"]],
                                  "Average Purchase Price": [Gender_average_price.loc["Male"],Gender_average_price.loc["Female"],Gender_average_price.loc["Other / Non-Disclosed"]],
                                  "Total Purchase Value": [Gender_purchase_count.loc["Male"],Gender_purchase_count.loc["Female"],Gender_purchase_count.loc["Other / Non-Disclosed"]],
                                  "Normalized Totals": [ male_normalized_total, female_normalized_total, other_normalized_total],
                                  "# players(each group)":[(len(Male_count_df)), (len(Female_count_df)),(len(Other_count_df))]}
            

purchasing_analysis_gender_df = pd.DataFrame(purchasing_analysis_gender_dic) # Set the row index to be "Gender"

purchasing_analysis_gender_df['Average Purchase Price'] = purchasing_analysis_gender_df['Average Purchase Price'].apply(dollarsign)
purchasing_analysis_gender_df['Normalized Totals'] = purchasing_analysis_gender_df['Normalized Totals'].apply(dollarsign)
purchasing_analysis_gender_df['Total Purchase Value'] = purchasing_analysis_gender_df['Total Purchase Value'].apply(dollarsign)


#purchasing_analysis_gender_df

In [147]:
purchasing_analysis_gender_df = purchasing_analysis_gender_df.set_index("Gender")
purchasing_analysis_gender_df

,# players(each group),Average Purchase Price,Normalized Totals,Purchase Count,Total Purchase Value
Gender,,,,,
Male,60,$2.88,$3.08,64,$184.60
Female,13,$3.18,$3.18,13,$41.38
Other/Non-Disclosed,1,$2.12,$2.12,1,$2.12

In [148]:
#==================================================================================================================

In [149]:
##################### This is the Starting section for " PURCHASING ANALYSIS (Age) " ##############################

In [150]:
#==================================================================================================================

In [151]:
# First call my_data to examine it 
clean_df.head()

   Age Gender  Item ID                 Item Name  Price          SN
0   20   Male       93  Apocalyptic Battlescythe   4.49     Iloni35
1   21   Male       12                     Dawne   3.36   Aidaira26
2   17   Male        5                Putrid Fan   2.63      Irim47
3   17   Male      123         Twilight's Carver   2.55     Irith83
4   22   Male      154              Feral Katana   4.11  Philodil43

In [152]:
#clean_df["SN"].count()
# This is the dataframe object which has all the sum of "Price" column grouped with the "Gender"
sum_Age_df = grouped_Gender_df[["Price"]].sum()
#sum_Age_df

In [153]:
#Create bins and bin labels for the Age Column

age_bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
age_labels = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+" ]

#Bin the Age column
# cut() returns a Pandas Series containing each of the binned column's values translated into their corresponding bins

pd.cut(clean_df["Age"], age_bins, labels=age_labels)

0     20-24
1     20-24
2     15-19
3     15-19
4     20-24
5       <10
6       40+
7     25-29
8     15-19
9     35-39
10    20-24
11    35-39
12    20-24
13    30-34
14      <10
15    20-24
16    20-24
17      <10
18    10-14
19    20-24
20    35-39
21    10-14
22    15-19
23    20-24
24    20-24
25    15-19
26      <10
27    25-29
28    20-24
29    20-24
      ...
48    25-29
49    20-24
50    20-24
51    25-29
52    20-24
53    15-19
54    25-29
55    20-24
56    15-19
57    20-24
58    30-34
59    35-39
60    20-24
61    20-24
62    15-19
63    10-14
64    20-24
65    20-24
66    20-24
67    20-24
68    20-24
69    30-34
70    25-29
71    25-29
72    20-24
73    35-39
74    35-39
75    15-19
76    20-24
77    20-24
Name: Age, Length: 78, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [154]:
type(age_bins)

list

In [155]:
# We can append our new bins to clean_df

clean_df["Age_Category"] = pd.cut(clean_df["Age"], age_bins, labels=age_labels)
#clean_df.head()

In [156]:
# Binning allowing for more vigorous analysis
# we can now group by our bins for mean/Average value

grouped_age_purchase_df = clean_df.groupby("Age_Category")

 
#avg_purchase_price = grouped_age_purchase_df["Price"].mean()
#grouped_age_purchase_df

In [157]:
# Binning allowing for more vigorous analysis
# we can now group by our bins for sum value

grouped_age_purchase_df = clean_df.groupby("Age_Category")
 
#This is to create in variables to assign the values of sum later
tot_purchase_value = grouped_age_purchase_df["Price" ].sum() 
tot_purchase_value

Age_Category
<10       13.82
10-14      8.96
15-19     30.41
20-24    108.89
25-29     26.11
30-34     13.89
35-39     21.37
40+        4.65
Name: Price, dtype: float64

In [158]:
# This gives us the count of all the bins in categorized
#grouped_age_purchase_df.count()

In [159]:
purchase_count = grouped_age_purchase_df["Gender"].value_counts() # saving in variables
p1 = purchase_count.loc['<10'].sum()
p2 = purchase_count.loc['10-14'].sum()
p3 = purchase_count.loc['15-19'].sum()
p4 = purchase_count.loc['20-24'].sum()
p5 = purchase_count.loc['25-29'].sum()
p6 = purchase_count.loc['30-34'].sum()
p7 = purchase_count.loc['35-39'].sum()
p8 = purchase_count.loc['40+'].sum()

#purchase_count 
#purchase_count.loc['<10'].sum()

In [160]:
# Normalized Totals for Age demographics
# Total Purchase Value/# of people each group
normalized1 = tot_purchase_value.iloc[0]/p1
normalized2 = tot_purchase_value.iloc[1]/p2
normalized3 = tot_purchase_value.iloc[2]/p3
normalized4 = tot_purchase_value.iloc[3]/p4
normalized5 = tot_purchase_value.iloc[4]/p5
normalized6 = tot_purchase_value.iloc[5]/p6
normalized7 = tot_purchase_value.iloc[6]/p7
normalized8 = tot_purchase_value.iloc[7]/p8
 
#normalized2

In [161]:
# Average purchase price (Total Purchase value/purchase count) 
avg_purchase1 = tot_purchase_value.iloc[0]/purchase_count.iloc[0]
avg_purchase2 = tot_purchase_value.iloc[1]/purchase_count.iloc[1]
avg_purchase3 = tot_purchase_value.iloc[2]/purchase_count.iloc[2]
avg_purchase4 = tot_purchase_value.iloc[3]/purchase_count.iloc[3]
avg_purchase5 = tot_purchase_value.iloc[4]/purchase_count.iloc[4]
avg_purchase6 = tot_purchase_value.iloc[5]/purchase_count.iloc[5]
avg_purchase7 = tot_purchase_value.iloc[6]/purchase_count.iloc[6]
avg_purchase8 = tot_purchase_value.iloc[7]/purchase_count.iloc[7]

In [162]:
# Creating a new dataframe for Purchasing Analysis (Age)
purchasing_analysis_Age_dic = {"Age": ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"],
                                  "Average Purchase Price": [avg_purchase1,
                                                             avg_purchase2,
                                                             avg_purchase3,
                                                             avg_purchase4,
                                                             avg_purchase5,
                                                             avg_purchase6,
                                                             avg_purchase7,
                                                             avg_purchase8],
                                  "Total Purchase Value": [tot_purchase_value.iloc[0],
                                                           tot_purchase_value.iloc[1],
                                                           tot_purchase_value.iloc[2],
                                                           tot_purchase_value.iloc[3],
                                                           tot_purchase_value.iloc[4],
                                                           tot_purchase_value.iloc[5],
                                                           tot_purchase_value.iloc[6],
                                                           tot_purchase_value.iloc[7]],
                                  "Normalized Totals": [normalized1,
                                                        normalized2,
                                                        normalized3,
                                                        normalized4,
                                                        normalized5,
                                                        normalized6,
                                                        normalized7,
                                                        normalized8],
                                  "Purchase Count": [purchase_count.iloc[0],
                                                     purchase_count.iloc[1],
                                                     purchase_count.iloc[2],
                                                     purchase_count.iloc[3],
                                                     purchase_count.iloc[4],
                                                     purchase_count.iloc[5],
                                                     purchase_count.iloc[6],
                                                     purchase_count.iloc[7]],
                                    "# people each group": [p1,
                                                               p2,
                                                               p3,
                                                               p4,
                                                               p5,
                                                               p6,
                                                               p7,
                                                               p8]}

purchasing_analysis_Age_df = pd.DataFrame(purchasing_analysis_Age_dic) # Set the row index to be "Age"

purchasing_analysis_Age_df['Average Purchase Price'] = purchasing_analysis_Age_df['Average Purchase Price'].apply(dollarsign)
purchasing_analysis_Age_df['Total Purchase Value'] = purchasing_analysis_Age_df['Total Purchase Value'].apply(dollarsign)
purchasing_analysis_Age_df['Normalized Totals'] = purchasing_analysis_Age_df['Normalized Totals'].apply(dollarsign)

purchasing_analysis_Age_df = purchasing_analysis_Age_df.set_index("Age")
purchasing_analysis_Age_df

purchasing_analysis_Age_df

,# people each group,Average Purchase Price,Normalized Totals,Purchase Count,Total Purchase Value
Age,,,,,
<10,5,$2.76,$2.76,5,$13.82
10-14,3,$8.96,$2.99,1,$8.96
15-19,11,$30.41,$2.76,1,$30.41
20-24,36,$108.89,$3.02,1,$108.89
25-29,9,$2.90,$2.90,9,$26.11
30-34,7,$6.94,$1.98,2,$13.89
35-39,6,$0.74,$3.56,29,$21.37
40+,1,$0.66,$4.65,7,$4.65

In [402]:
#==================================================================================================================

In [403]:
##################### This is the Starting section for " TOP SPENDERS " ##############################

In [404]:
#==================================================================================================================

In [426]:
# First call my_data to examine it 
clean_df.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age_Category
0,20,Male,93,Apocalyptic Battlescythe,4.49,Iloni35,20-24
1,21,Male,12,Dawne,3.36,Aidaira26,20-24
2,17,Male,5,Putrid Fan,2.63,Irim47,15-19
3,17,Male,123,Twilight's Carver,2.55,Irith83,15-19
4,22,Male,154,Feral Katana,4.11,Philodil43,20-24

In [427]:
#create a new FILTERABLE object that has the count of each group (Male, Female, Other count) 

grouped_df = clean_df.groupby(["SN"])['Price'].sum()
#grouped_df

#Saving in a DataFrame format. Building the tables one by one
#grouped_SN = clean_df.groupby(["SN"]).agg({'Price': 'sum'})
top_spenders_df = pd.DataFrame(grouped_df)
#top_spenders_df.head()

In [428]:
#Rename the column Price to "Total Purchase Value"
top_spenders_df.rename(columns={'Price': 'Total_Purchase_Value'}, inplace=True)

In [415]:
# To get the count of the players for each category
grouped_count = clean_df.groupby(["SN"])['Age'].count()
#grouped_count

In [429]:
# Pass in drop=True to prevent appending a new column with the old indexes to the dataframe
#top_spenders_df.reset_index(drop=True)
#top_spenders_df.head()

top_spenders_df['Purchase_Count'] = pd.DataFrame(clean_df.groupby(["SN"])['Age'].count())
top_spenders_df['Average_Purchase_Price'] = top_spenders_df['Total_Purchase_Value'].div(top_spenders_df['Purchase_Count'])

 
#top_spenders_df.head()

In [436]:
# Sorting in the highest values of top 5 player purchases
sorted_df =top_spenders_df.sort_values("Total_Purchase_Value", ascending=False) 
#sorted_df = sorted_df.reset_index(drop=True)
#sorted_df.head()

In [437]:
# After the sorting, then formating the sorted values, because the sort does not work with formats '$'
format_top_spenders_df = sorted_df
format_top_spenders_df['Average_Purchase_Price'] = format_top_spenders_df['Average_Purchase_Price'].apply(dollarsign)
format_top_spenders_df['Total_Purchase_Value'] = format_top_spenders_df['Total_Purchase_Value'].apply(dollarsign)
format_top_spenders_df.head()

           Total_Purchase_Value  Purchase_Count Average_Purchase_Price
SN
Sundaky74                 $7.41               2                  $3.71
Aidaira26                 $5.13               2                  $2.56
Eusty71                   $4.81               1                  $4.81
Chanirra64                $4.78               1                  $4.78
Alarap40                  $4.71               1                  $4.71

In [435]:
#==================================================================================================================#

In [323]:
##################### This is the Starting section for " MOST POPULAR ITEMS " ##############################

In [324]:
#==================================================================================================================#

In [325]:
# First call my_data to examine it 
clean_df.head()

,Age,Gender,Item ID,Item Name,Price,SN,Age_Category
0,20,Male,93,Apocalyptic Battlescythe,4.49,Iloni35,20-24
1,21,Male,12,Dawne,3.36,Aidaira26,20-24
2,17,Male,5,Putrid Fan,2.63,Irim47,15-19
3,17,Male,123,Twilight's Carver,2.55,Irith83,15-19
4,22,Male,154,Feral Katana,4.11,Philodil43,20-24

In [337]:
# Set Item ID as our index
clean_df_indexed_on_id = clean_df.set_index('Item Name')
clean_df_indexed_on_id.head()

                          Age Gender  Item ID  Price          SN Age_Category
Item Name
Apocalyptic Battlescythe   20   Male       93   4.49     Iloni35        20-24
Dawne                      21   Male       12   3.36   Aidaira26        20-24
Putrid Fan                 17   Male        5   2.63      Irim47        15-19
Twilight's Carver          17   Male      123   2.55     Irith83        15-19
Feral Katana               22   Male      154   4.11  Philodil43        20-24

In [338]:
#clean_df_indexed_on_id.index

In [339]:
# Grouped Dataframe by Item ID and Item Name and created new dataframe
grouped_ItemID_Name_df = clean_df.groupby(["Item ID", "Item Name"])

grouped_ItemID_Name_df.sum()

most_popular_df = pd.DataFrame(grouped_ItemID_Name_df.sum())
#most_popular_df.head()

In [340]:
# adding new column  to existing dataframe
most_popular_df['Purchase_Count'] = clean_df.groupby(["Item ID", "Item Name"])["Item Name"].count()
#most_popular_df.head()

In [341]:
#  Rename column 'Item Price'of Price dataframe 
most_popular_df = most_popular_df.rename(columns={'Price': 'Item_Price' })
#most_popular_df.head()

In [342]:
# Total Purchase Value calculations
most_popular_df['Total_Purchase_Value'] = most_popular_df['Purchase_Count'].mul(most_popular_df['Item_Price'])

most_popular_df['Item_Price'] = most_popular_df['Item_Price'].apply(dollarsign)
most_popular_df['Total_Purchase_Value'] = most_popular_df['Total_Purchase_Value'].apply(dollarsign)
 
#most_popular_df.head()

In [343]:
# Drop the Age column to create new dataframe of Most popular Items

 
#new_size_df = Heroes_popular_df.sum()
most_popular_df.drop('Age', axis = 1, inplace=True )

In [344]:
# Sorting in the highest values of top 5  purchase count
sorted_most_popular_df = most_popular_df.sort_values("Purchase_Count", ascending=False) 
sorted_most_popular_df.head()

                       Item_Price  Purchase_Count Total_Purchase_Value
Item ID Item Name
94      Mourning Blade     $10.92               3               $32.76
90      Betrayer            $8.24               2               $16.48
111     Misery's End        $3.58               2                $7.16
64      Fusion Pummel       $4.84               2                $9.68
154     Feral Katana        $8.22               2               $16.44

In [355]:
#==================================================================================================================#

In [356]:
##################### This is the Starting section for " MOST PROFITABLE(Purchase Value) ITEMS " ##############################

In [357]:
#==================================================================================================================#

In [358]:
# First call my_data to examine it 
print(len(clean_df))
clean_df.head()

# Grouped Dataframe by Item ID and Item Name and created new dataframe
grouped_ItemID_Name_df = clean_df.groupby(["Item ID", "Item Name"])

grouped_ItemID_Name_df.sum()

most_profitable_df = pd.DataFrame(grouped_ItemID_Name_df.sum())
#most_profitable_df.head() 

# adding new column  to existing dataframe
most_profitable_df['Purchase_Count'] = clean_df.groupby(["Item ID", "Item Name"])["Item Name"].count()
 

#  Rename column 'Item Price'of Price dataframe 
most_profitable_df = most_profitable_df.rename(columns={'Price': 'Item_Price' })
 
# Total Purchase Value calculations
most_profitable_df['Total_Purchase_Value'] = most_profitable_df['Purchase_Count'].mul(most_profitable_df['Item_Price'])

#new_size_df = Heroes_popular_df.sum()
most_profitable_df.drop('Age', axis = 1, inplace=True )

78

In [364]:
# Sorting in the highest values of top 5 Most Profitable Items without a dollarsign '$'
sorted_top_profitable_df = most_profitable_df.sort_values("Total_Purchase_Value", ascending=False) 
#sorted_top_profitable_df.head()

In [365]:
#  After sorting, I am formating with dollar sign. Because my sort does not work with %, $...
format_sorted_top_profitable_df = sorted_top_profitable_df
format_sorted_top_profitable_df['Item_Price'] = format_sorted_top_profitable_df['Item_Price'].apply(dollarsign)
format_sorted_top_profitable_df['Total_Purchase_Value'] = format_sorted_top_profitable_df['Total_Purchase_Value'].apply(dollarsign)

In [366]:
format_sorted_top_profitable_df.head()

,,Item_Price,Purchase_Count,Total_Purchase_Value
Item ID,Item Name,,,
94,Mourning Blade,$10.92,3,$32.76
117,"Heartstriker, Legacy of the Light",$9.42,2,$18.84
93,Apocalyptic Battlescythe,$8.98,2,$17.96
90,Betrayer,$8.24,2,$16.48
154,Feral Katana,$8.22,2,$16.44